/****************************************************************************
За молоком

Леон и Матильда собрались пойти в магазин за молоком. Их хочет поймать Стэнсфилд, поэтому нашим товарищам нужно сделать это как можно быстрее. Каково минимальное количество улиц, по которым пройдёт хотя бы один из ребят (либо Матильда, либо Леон, либо оба вместе)?

Граф связный и неориентированный. Вершины нумеруются с 1.

Ввод: 
Первая строка содержит количество вершин n (1 ≤ n ≤ 10^5), количество ребер m (0 ≤ m ≤ 10^5) и номера вершин графа leon, matilda, milk, в которых находятся соответственно Леон, Матильда и магазин с молоком.
Следующие m строк содержат ребра графа. В каждой строке два числа, разделенные пробелом, если между i и j существует ребро. Гарантируется, что в графе нет петель и мультиребер.

Вывод: Одно число – количество ребер.


  in       | out
 ----------|-----
 3 2 1 2 3 |  2
 1 3       |
 2 3       |

 
  in       | out
 ----------|-----
 3 2 1 2 3 |  2
 1 3       |
 1 2       |
 

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

